Revit 2024 API
EnergyAnalysisOpening.OriginatingElementId Property
 The element id for the originating Revit element.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public LinkElementId OriginatingElementId { get; }
Visual Basic
Public ReadOnly Property OriginatingElementId As LinkElementId
	Get
Visual C++
public:
property LinkElementId^ OriginatingElementId {
	LinkElementId^ get ();
}
See Also
EnergyAnalysisOpening Class
Autodesk.Revit.DB.Analysis Namespace